app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @recipe = Recipe.find(id)

SELECT "cuisines".* FROM "cuisines"
SELECT "recipe_types".* FROM "recipe_types"
---
  def new
    @recipe = Recipe.new
    @cuisines = Cuisine.all
    @recipe_types = RecipeType.all

INSERT INTO "recipes" ("title", "difficulty", "cook_time", "created_at", "updated_at", "ingredients", "cook_method", "cuisine_id", "recipe_type_id", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cuisines".* FROM "cuisines"
SELECT "recipe_types".* FROM "recipe_types"
---
  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
      redirect_to recipe_path(@recipe.id)
    else
      @cuisines = Cuisine.all
      @recipe_types = RecipeType.all

SELECT "recipe_types".* FROM "recipe_types"
SELECT "cuisines".* FROM "cuisines"
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @recipe_types = RecipeType.all
    @cuisines = Cuisine.all
    @recipe = Recipe.find(params[:id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = ?, "difficulty" = ?, "cook_time" = ?, "ingredients" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "Africaninha"], ["difficulty", "fácil"], ["cook_time", 60], ["ingredients", "Amor"], ["updated_at", "2018-07-10 10:39:04.291164"], ["id", 1]]
SELECT "cuisines".* FROM "cuisines"
SELECT "recipe_types".* FROM "recipe_types"
---
  def update
    @recipe = Recipe.find(params[:id])

    if @recipe.update(recipe_params)
      flash[:notice] = 'Suas alterações foram salvas com sucesso!'
      redirect_to recipe_path(@recipe.id)
    else
      @cuisines = Cuisine.all
      @recipe_types = RecipeType.all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."title" = ?  [["title", "Bolo de cenoura"]]
SELECT  1 AS one FROM "recipes" WHERE "recipes"."title" = ? LIMIT ?  [["title", "Bolo de cenoura"], ["LIMIT", 1]]
---
  def buscar
    nome = params[:nome]
    @busca = Recipe.where(title: nome)
    if @busca.empty?